# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

print(', '.join(names))   # 1 вариант

#print( *names, sep=",")   # 2 вариант


# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
